# Terraform plan for production
  
  ```
  Plan: 5 to add, 0 to change, 0 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=prd-piny940/iamcredentials.googleapis.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool]
module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks: Refreshing state... [id=projects/prd-piny940/secrets/home-kubernetes-cluster-jwks]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=clubroom.piny940.com]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Reading...
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Read complete after 0s [id=projects/1056391010239/secrets/home-kubernetes-cluster-jwks/versions/1]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=prd-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=prd-piny940/roles/owner/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:production]
module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/terraform-github-actions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.clubroom.google_project_iam_member.clubroom_storage_object_user will be created
  + resource "google_project_iam_member" "clubroom_storage_object_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/storage.objectCreator"
    }

  # module.clubroom.google_project_iam_member.clubroom_workload_identity_user will be created
  + resource "google_project_iam_member" "clubroom_workload_identity_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.clubroom.google_service_account.clubroom will be created
  + resource "google_service_account" "clubroom" {
      + account_id                   = "clubroom"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "Clubroom"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "prd-piny940"
      + unique_id                    = (known after apply)
    }

  # module.clubroom.google_service_account_iam_member.ksa_workload_identity_user will be created
  + resource "google_service_account_iam_member" "ksa_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:clubroom"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes will be created
  + resource "google_iam_workload_identity_pool_provider" "home_kubernetes" {
      + attribute_mapping                  = {
          + "google.subject" = "assertion.sub"
        }
      + description                        = "for Kubernetes in the home"
      + display_name                       = "Home Kubernetes"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "prd-piny940"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "pool"
      + workload_identity_pool_provider_id = "home-kubernetes"

      + oidc {
          + issuer_uri = "https://kubernetes.default.svc.cluster.local"
          + jwks_json  = (sensitive value)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
